# Заходим в спотлайт и пишем  "терминал" или "Terminal"

# ~ - символ домашней директории(папки)
# / - символ корневой директории(папка)

# .. -  2 точки обозначает  предыдущая  директория(папка)
# . - 1 точка обозначат текущую директорию(папку)

# ls( list)  - (лист) выводит список всех папок(директорий) и файлов в текущей 

# cd (change directory) -> меняет текущую директорию(папку) на указанную 
# (cd <название директории>)


# touch ->  создает указанный файл (touch < name_of_file >)


# pwd (present working directory) -> выводит путь до текущей директории(папка)

# mkdir ( make directory) -> создает указанную директорию (папку)

# rmdir ( remove directory ) ->  удаляет указанную директорию(папку) 
 
# rm -> удаляет ФАЙЛЫ

# rm -rf ->  удаляет все ( лучше не пользоваться)

# ls -a -> выводит список как скрытых так и обычных директорий(папок) и файлов

# nano <path_to_file> -> открывает графический интерфейс для редактирования файла *если нет указанного файла ,то создаться новый файл с таким именем 

# cat < path_to_file > -> выводит содержимое файла

# history -> показывает всю историю команд


# mv < name_newname> -> изменяет название директории


# ping ->  узнать пинг сайта 

# du + file ->  сколько места в памяти занимает определенный файл.
 



